configuration/src/InformationRegisters/ВерсииАссетов/ВерсииАссетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииАссетов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обновлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипАссетов</name>
    <type>
      <types>CatalogRef.ТипыАссетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ВерсииАссетов/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПолучитьТекущуюВерсию(Знач ТипАссетов) Экспорт
	
	Версия = "";
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВерсииАссетовСрезПоследних.Версия КАК Версия
	|ИЗ
	|	РегистрСведений.ВерсииАссетов.СрезПоследних(
	|			&Дата,
	|			ТипАссетов = &ТипАссетов
	|				И Обновлен) КАК ВерсииАссетовСрезПоследних";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТипАссетов", ТипАссетов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Версия = Выборка.Версия;
	КонецЕсли;
	
	Возврат Версия;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Раздел «Служебные процедуры и функции» содержит процедуры и функции, составляющие 
// внутреннюю реализацию общего модуля.

#КонецОбласти
